/*
시계 방향으로 한 칸씩 회전하는 컨베이어 벨트가 있습니다. 
컨베이어 벨트 위아래로 n개씩 총 2 * n 개의 숫자가 두 줄로 적혀 있고, 1초에 한 칸씩 움직입니다.
t초의 시간이 흐른 뒤 컨베이어 벨트에 놓여있는 숫자들의 상태를 출력하는 프로그램을 작성해보세요.

입력 형식
첫 번째 줄에는 n과 t가 공백을 사이에 두고 주어집니다.

두 번째 줄에는 위 변에 있는 초기 n개의 숫자들이 공백을 사이에 두고 주어집니다.

세 번째 줄에는 아래 변에 있는 초기 n개의 숫자들이 공백을 사이에 두고 주어집니다.

숫자는 각 변마다 숫자가 올바르게 보이는 방향에서 바라봤을 때 왼쪽에서 오른쪽 순으로 주어집니다.

1 ≤ n ≤ 200

1 ≤ t ≤ 1,000

1 ≤ 주어지는 숫자 ≤ 9

출력 형식
t초 후 컨베이어 벨트에 놓여있는 숫자들의 상태를 출력합니다.

첫 번째 줄에는 위 위 변에 있는 n개의 숫자들을 공백을 사이에 두고 출력합니다.

두 번째 줄에는 아래 변에 있는 n개의 숫자들을 공백을 사이에 두고 출력합니다.

숫자는 각 변마다 입력으로 주어지는 순서대로 출력합니다.

입출력 예제
예제1
입력:

3 1
1 2 3
6 5 1
출력:

1 1 2
3 6 5
예제2
입력:

3 3
1 2 3
6 5 1
출력:

6 5 1
1 2 3
*/

#include <iostream>

#define MAX_N 200

using namespace std;

// 전역 변수 선언:
int n, t;

int u[MAX_N + 1]; // 첫번째 줄
int d[MAX_N + 1]; // 두번째 줄

int main() {
    cin >> n >> t;

    for(int i = 0; i < n; i++){
        cin >> u[i];
    }
    for(int i = 0; i < n; i++){
        cin >> d[i];
    }

    while(t--){
        int temp = u[n-1]; // 첫번째 줄 가장 오른쪽 하나 미리 보관
        
        for(int i = n - 1; i >= 1; i--)
            u[i] = u[i - 1];
        u[0] = d[n - 1];

        for(int i = n - 1; i >= 1; i--)
            d[i] = d[i - 1];
        d[0] = temp;
    }

    // 출력:
    for(int i = 0; i < n; i++)
		cout << u[i] << " ";
	cout << endl;
    
	for(int i = 0; i < n; i++)
		cout << d[i] << " ";

    return 0;
}
